### Terraform `plan` Succeeded for Workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.lambda_function.aws_lambda_function.this[0] will be updated in-place
!   resource "aws_lambda_function" "this" {
        id                             = "cataprato-core-lambda"
!       last_modified                  = "2023-08-17T19:57:23.000+0000" -> (known after apply)
!       qualified_arn                  = "arn:aws:lambda:us-east-1:350131064538:function:cataprato-core-lambda:15" -> (known after apply)
!       qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:350131064538:function:cataprato-core-lambda:15/invocations" -> (known after apply)
!       s3_key                         = "lambda-builds/2a12cae9f23181b408cd6aca446db4e24d50ae63e559a8e63e107ac14296705a.zip" -> "lambda-builds/afcafa2c4a900733e1f4498c9903a674e78433ea75d01fdac0938e5385445c07.zip"
!       s3_object_version              = "Kr3NHTwsH8wHQqr.IBswKOl0S_4StIvj" -> (known after apply)
        tags                           = {
            "Deployment" = "terraform"
        }
!       version                        = "15" -> (known after apply)
        # (19 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function.aws_lambda_permission.current_version_triggers["APIGatewayAny"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
!       id                  = "APIGatewayAny" -> (known after apply)
!       qualifier           = "15" -> (known after apply)
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
!       bucket_key_enabled     = false -> (known after apply)
!       content_type           = "binary/octet-stream" -> (known after apply)
!       etag                   = "27e84b57de68df0b252b89da5dea91b2" -> (known after apply)
!       id                     = "lambda-builds/2a12cae9f23181b408cd6aca446db4e24d50ae63e559a8e63e107ac14296705a.zip" -> (known after apply)
!       key                    = "lambda-builds/2a12cae9f23181b408cd6aca446db4e24d50ae63e559a8e63e107ac14296705a.zip" -> "lambda-builds/afcafa2c4a900733e1f4498c9903a674e78433ea75d01fdac0938e5385445c07.zip"
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
!       server_side_encryption = "AES256" -> (known after apply)
!       source                 = "./.terraform/lambda-builds/2a12cae9f23181b408cd6aca446db4e24d50ae63e559a8e63e107ac14296705a.zip" -> "./.terraform/lambda-builds/afcafa2c4a900733e1f4498c9903a674e78433ea75d01fdac0938e5385445c07.zip"
        tags                   = {
            "Deployment" = "terraform"
        }
!       version_id             = "Kr3NHTwsH8wHQqr.IBswKOl0S_4StIvj" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "./.terraform/lambda-builds/"
+               build_plan    = [
+                   [
+                       "zip",
+                       "./dist/app",
+                       null,
                    ],
                ]
+               filename      = "./.terraform/lambda-builds/afcafa2c4a900733e1f4498c9903a674e78433ea75d01fdac0938e5385445c07.zip"
+               runtime       = "nodejs18.x"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "./.terraform/lambda-builds/afcafa2c4a900733e1f4498c9903a674e78433ea75d01fdac0938e5385445c07.plan.json"
+       id                   = (known after apply)
    }

  # module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
!       id       = "5658593126874151923" -> (known after apply)
!       triggers = {
!           "filename"  = "./.terraform/lambda-builds/2a12cae9f23181b408cd6aca446db4e24d50ae63e559a8e63e107ac14296705a.zip" -> "./.terraform/lambda-builds/afcafa2c4a900733e1f4498c9903a674e78433ea75d01fdac0938e5385445c07.zip"
!           "timestamp" = "1692302164761391000" -> "1692303380009783000"
        }
    }

  # module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
!       id       = "4499731821178010667" -> (known after apply)
!       triggers = {
!           "built_output_path"    = "./.terraform/lambda-builds/2a12cae9f23181b408cd6aca446db4e24d50ae63e559a8e63e107ac14296705a.zip" -> "./.terraform/lambda-builds/afcafa2c4a900733e1f4498c9903a674e78433ea75d01fdac0938e5385445c07.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.lambda_layer_s3.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
!       id       = "4194680029466895016" -> (known after apply)
!       triggers = {
!           "timestamp" = "1692302168688119800" -> "1692303384166510200"
            # (1 unchanged element hidden)
        }
    }

Plan: 6 to add, 1 to change, 5 to destroy.
```
</details>